tap 'homebrew/core'
tap 'homebrew/bundle'
tap 'homebrew/services'
tap 'caskroom/fonts'
tap 'caskroom/cask'
# tap 'installfest/wdi'

# CLI utils
brew 'bash'
brew 'rsync'
brew 'nano'
brew 'tree'
brew 'figlet'

# core utils
brew 'git'
brew 'bash-git-prompt'
brew 'bash-completion'
brew 'tig'

# language support
brew 'node'
brew 'yarn'
brew 'ruby'


# others
brew 'phantomjs'
brew 'heroku'
brew 'tidy-html5'
brew 'lighttpd'

# databases
brew 'postgresql', restart_service: true
# brew 'mongodb', restart_service: true
brew 'sqlite'
# brew 'redis'


cask 'sublime-text'
cask 'spectacle'
cask 'slack'
cask 'caskroom/fonts/font-dejavusansmono-nerd-font'
cask 'caskroom/fonts/font-dejavusansmono-nerd-font-mono'
cask 'caskroom/fonts/font-inconsolata-nerd-font'
cask 'caskroom/fonts/font-inconsolata-nerd-font-mono'
cask 'caskroom/fonts/font-meslo-nerd-font'
cask 'caskroom/fonts/font-meslo-nerd-font-mono'
cask 'caskroom/fonts/font-sourcecodepro-nerd-font'
cask 'caskroom/fonts/font-sourcecodepro-nerd-font-mono'
